---
kind: method
id: M:Autodesk.Revit.DB.AddInId.GetGUID
source: html/75d1c78b-31b0-a5b3-abce-ebd57653d6f4.htm
---
# Autodesk.Revit.DB.AddInId.GetGUID Method

value of the AddInId as a GUID

## Syntax (C#)
```csharp
public Guid GetGUID()
```

## Returns
GUID value of the AddInId